#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: renovate[bot], Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
data.sakuracloud_archive.ubuntu_archive: Reading...
data.sakuracloud_archive.ubuntu_archive: Read complete after 1s [id=113601947141]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.local_file.ssh-key will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "local_file" "ssh-key" {
      + content              = (known after apply)
      + content_base64       = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + filename             = "../dev/keys"
      + id                   = (known after apply)
    }

  # null_resource.ssh-key will be created
  + resource "null_resource" "ssh-key" {
      + id = (known after apply)
    }

  # random_password.cluster_pass will be created
  + resource "random_password" "cluster_pass" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # sakuracloud_disk.k8s_control_plane_disk[0] will be created
  + resource "sakuracloud_disk" "k8s_control_plane_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "drove-dev-control-plane-1"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + source_archive_id    = "113601947141"
      + tags                 = [
          + "dev",
          + "drove",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] will be created
  + resource "sakuracloud_disk" "k8s_control_plane_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "drove-dev-control-plane-2"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + source_archive_id    = "113601947141"
      + tags                 = [
          + "dev",
          + "drove",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] will be created
  + resource "sakuracloud_disk" "k8s_control_plane_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "drove-dev-control-plane-3"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + source_archive_id    = "113601947141"
      + tags                 = [
          + "dev",
          + "drove",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_rook_disk[0] will be created
  + resource "sakuracloud_disk" "k8s_rook_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "drove-dev-rook-1"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + tags                 = [
          + "dev",
          + "drove",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_rook_disk[1] will be created
  + resource "sakuracloud_disk" "k8s_rook_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "drove-dev-rook-2"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + tags                 = [
          + "dev",
          + "drove",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_rook_disk[2] will be created
  + resource "sakuracloud_disk" "k8s_rook_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "drove-dev-rook-3"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + tags                 = [
          + "dev",
          + "drove",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_rook_disk[3] will be created
  + resource "sakuracloud_disk" "k8s_rook_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "drove-dev-rook-4"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + tags                 = [
          + "dev",
          + "drove",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_rook_disk[4] will be created
  + resource "sakuracloud_disk" "k8s_rook_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "drove-dev-rook-5"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + tags                 = [
          + "dev",
          + "drove",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_rook_disk[5] will be created
  + resource "sakuracloud_disk" "k8s_rook_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "drove-dev-rook-6"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + tags                 = [
          + "dev",
          + "drove",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] will be created
  + resource "sakuracloud_disk" "k8s_worker_node_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "drove-dev-worker-node-1"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + source_archive_id    = "113601947141"
      + tags                 = [
          + "dev",
          + "drove",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] will be created
  + resource "sakuracloud_disk" "k8s_worker_node_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "drove-dev-worker-node-2"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + source_archive_id    = "113601947141"
      + tags                 = [
          + "dev",
          + "drove",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] will be created
  + resource "sakuracloud_disk" "k8s_worker_node_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "drove-dev-worker-node-3"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + source_archive_id    = "113601947141"
      + tags                 = [
          + "dev",
          + "drove",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_worker_node_disk[3] will be created
  + resource "sakuracloud_disk" "k8s_worker_node_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "drove-dev-worker-node-4"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + source_archive_id    = "113601947141"
      + tags                 = [
          + "dev",
          + "drove",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_worker_node_disk[4] will be created
  + resource "sakuracloud_disk" "k8s_worker_node_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "drove-dev-worker-node-5"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + source_archive_id    = "113601947141"
      + tags                 = [
          + "dev",
          + "drove",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_disk.k8s_worker_node_disk[5] will be created
  + resource "sakuracloud_disk" "k8s_worker_node_disk" {
      + connector            = "virtio"
      + encryption_algorithm = "none"
      + id                   = (known after apply)
      + name                 = "drove-dev-worker-node-6"
      + plan                 = "ssd"
      + server_id            = (known after apply)
      + size                 = 20
      + source_archive_id    = "113601947141"
      + tags                 = [
          + "dev",
          + "drove",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_dns.k8s_dns will be created
  + resource "sakuracloud_dns" "k8s_dns" {
      + dns_servers = (known after apply)
      + id          = (known after apply)
      + zone        = "drove-dev.ictsc.net"

      + record (known after apply)
    }

  # sakuracloud_dns_record.root_record_ipv4 will be created
  + resource "sakuracloud_dns_record" "root_record_ipv4" {
      + dns_id = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 300
      + type   = "A"
      + value  = (known after apply)
    }

  # sakuracloud_dns_record.root_record_ipv6 will be created
  + resource "sakuracloud_dns_record" "root_record_ipv6" {
      + dns_id = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 300
      + type   = "AAAA"
      + value  = (known after apply)
    }

  # sakuracloud_dns_record.wildcard_record will be created
  + resource "sakuracloud_dns_record" "wildcard_record" {
      + dns_id = (known after apply)
      + id     = (known after apply)
      + name   = "*"
      + ttl    = 300
      + type   = "CNAME"
      + value  = "drove-dev.ictsc.net."
    }

  # sakuracloud_internet.k8s_external_switch will be created
  + resource "sakuracloud_internet" "k8s_external_switch" {
      + band_width           = 100
      + enable_ipv6          = true
      + gateway              = (known after apply)
      + id                   = (known after apply)
      + ip_addresses         = (known after apply)
      + ipv6_network_address = (known after apply)
      + ipv6_prefix          = (known after apply)
      + ipv6_prefix_len      = (known after apply)
      + max_ip_address       = (known after apply)
      + min_ip_address       = (known after apply)
      + name                 = "drove-dev-external-switch"
      + netmask              = 28
      + network_address      = (known after apply)
      + server_ids           = (known after apply)
      + switch_id            = (known after apply)
      + tags                 = [
          + "dev",
          + "drove",
        ]
      + zone                 = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_control_plane[0] will be created
  + resource "sakuracloud_server" "k8s_control_plane" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + gpu_model         = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 8
      + name              = "drove-dev-control-plane-1"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "dev",
          + "drove",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "drove-dev-control-plane-1"
          + ip_address      = (known after apply)
          + netmask         = 28
          + password        = (sensitive value)
          + ssh_keys        = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.1"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_control_plane[1] will be created
  + resource "sakuracloud_server" "k8s_control_plane" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + gpu_model         = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 8
      + name              = "drove-dev-control-plane-2"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "dev",
          + "drove",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "drove-dev-control-plane-2"
          + ip_address      = (known after apply)
          + netmask         = 28
          + password        = (sensitive value)
          + ssh_keys        = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.2"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_control_plane[2] will be created
  + resource "sakuracloud_server" "k8s_control_plane" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + gpu_model         = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 8
      + name              = "drove-dev-control-plane-3"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "dev",
          + "drove",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = (known after apply)
          + hostname        = "drove-dev-control-plane-3"
          + ip_address      = (known after apply)
          + netmask         = 28
          + password        = (sensitive value)
          + ssh_keys        = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.3"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[0] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 4
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + gpu_model         = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 8
      + name              = "drove-dev-worker-node-1"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "dev",
          + "drove",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "192.168.100.254"
          + hostname        = "drove-dev-worker-node-1"
          + ip_address      = "192.168.100.101"
          + netmask         = 24
          + password        = (sensitive value)
          + ssh_keys        = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.101"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[1] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 4
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + gpu_model         = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 8
      + name              = "drove-dev-worker-node-2"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "dev",
          + "drove",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "192.168.100.254"
          + hostname        = "drove-dev-worker-node-2"
          + ip_address      = "192.168.100.102"
          + netmask         = 24
          + password        = (sensitive value)
          + ssh_keys        = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.102"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[2] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 4
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + gpu_model         = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 8
      + name              = "drove-dev-worker-node-3"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "dev",
          + "drove",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "192.168.100.254"
          + hostname        = "drove-dev-worker-node-3"
          + ip_address      = "192.168.100.103"
          + netmask         = 24
          + password        = (sensitive value)
          + ssh_keys        = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.103"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[3] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 4
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + gpu_model         = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 8
      + name              = "drove-dev-worker-node-4"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "dev",
          + "drove",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "192.168.100.254"
          + hostname        = "drove-dev-worker-node-4"
          + ip_address      = "192.168.100.104"
          + netmask         = 24
          + password        = (sensitive value)
          + ssh_keys        = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.104"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[4] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 4
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + gpu_model         = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 8
      + name              = "drove-dev-worker-node-5"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "dev",
          + "drove",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "192.168.100.254"
          + hostname        = "drove-dev-worker-node-5"
          + ip_address      = "192.168.100.105"
          + netmask         = 24
          + password        = (sensitive value)
          + ssh_keys        = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.105"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[5] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 4
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + gpu_model         = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 8
      + name              = "drove-dev-worker-node-6"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "dev",
          + "drove",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "192.168.100.254"
          + hostname        = "drove-dev-worker-node-6"
          + ip_address      = "192.168.100.106"
          + netmask         = 24
          + password        = (sensitive value)
          + ssh_keys        = (known after apply)
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = (known after apply)
          + user_ip_address = "192.168.100.106"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_switch.k8s_internal_switch will be created
  + resource "sakuracloud_switch" "k8s_internal_switch" {
      + id         = (known after apply)
      + name       = "drove-dev-internal-switch"
      + server_ids = (known after apply)
      + tags       = [
          + "dev",
          + "drove",
        ]
      + zone       = (known after apply)

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_vpc_router.k8s_internal_router will be created
  + resource "sakuracloud_vpc_router" "k8s_internal_router" {
      + id                  = (known after apply)
      + internet_connection = true
      + name                = "drove-dev-internal-router"
      + plan                = "standard"
      + public_ip           = (known after apply)
      + public_netmask      = (known after apply)
      + tags                = [
          + "dev",
          + "drove",
        ]
      + version             = 2
      + zone                = (known after apply)

      + private_network_interface {
          + index        = 1
          + ip_addresses = [
              + "192.168.100.254",
            ]
          + netmask      = 24
          + switch_id    = (known after apply)
        }

      + scheduled_maintenance (known after apply)

      + site_to_site_vpn_parameter (known after apply)
    }

Plan: 33 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_pass                 = (sensitive value)
  + ipv6_prefix                  = (known after apply)
  + ipv6_prefix_len              = (known after apply)
  + k8s_control_plane_ip_address = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + k8s_dns_nameservers          = (known after apply)
  + k8s_dns_zone                 = "drove-dev.ictsc.net"
  + k8s_worker_node_ip_address   = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + max_ip_address               = (known after apply)
  + min_ip_address               = (known after apply)
  + vip_address                  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>